import numpy as np

a = np.array([[1, 2, 3], [2, 3, 4], [3, 4, 5]])
b = np.array([[2.11, -0.8, 1.72], [-1.84, 3.03, 1.29], [-1.57, 5.25, 4.30]])
c = np.array([[2, -1, 0], [-1, 2, -1], [0, -1, 2]])
d = np.array([[4, 3, -1], [7, -2, 3], [5, -18, 13]])
if round(np.linalg.det(a), 10) == 0:
    print("строки матрицы а) линейно-зависимы")
else:
    print("строки матрицы а) независимы")

if round(np.linalg.det(b), 10) == 0:
    print("строки матрицы б) линейно-зависимы")
else:
    print("строки матрицы б) независимы")

if round(np.linalg.det(c), 10) == 0:
    print("строки матрицы в) линейно-зависимы")
else:
    print("строки матрицы в) независимы")

if round(np.linalg.det(d), 10) == 0:
    print("строки матрицы г) линейно-зависимы")
else:
    print("строки матрицы г) независимы")
